In [4]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [2]:
my_list = [1, 2, 3, 4]
my_labes = ["a", "b", "c", "d"]
my_dict = {"a": 1, "b": 2, "c": 3, "d": 4}

In [3]:
pd.Series(my_list, my_labes)

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
pd.Series(my_dict)

a    1
b    2
c    3
d    4
dtype: int64

In [5]:
ser1 = pd.Series([1, 2, 3], ["USA", "Germany", "USSR"])

In [6]:
ser1

USA        1
Germany    2
USSR       3
dtype: int64

In [7]:
ser2 = pd.Series([1, 2, 3],["USA", "Germany", "Japan"])

In [8]:
ser2

USA        1
Germany    2
Japan      3
dtype: int64

In [9]:
ser1 + ser2

Germany    4.0
Japan      NaN
USA        2.0
USSR       NaN
dtype: float64

In [10]:
ser1["USA"]

1

In [13]:
df = pd.DataFrame(randn(3,3), ["A", "B", "C"], ["W", "Y", "X"])

In [14]:
df

          W         Y         X
A  0.810607  1.439424 -0.377405
B  0.472935  1.174839  1.339455
C -0.379267  1.143235  0.649544

In [15]:
df["Y"]

A    1.439424
B    1.174839
C    1.143235
Name: Y, dtype: float64

In [21]:
df[["Y","X"]]

          Y         X
A  1.439424 -0.377405
B  1.174839  1.339455
C  1.143235  0.649544

In [22]:
df["NEW"] = df["W"] + df["Y"]

In [23]:
df

          W         Y         X       NEW
A  0.810607  1.439424 -0.377405  2.250030
B  0.472935  1.174839  1.339455  1.647774
C -0.379267  1.143235  0.649544  0.763968

In [27]:
df.drop("NEW", axis=1, inplace=True)

In [28]:
df

          W         Y         X
A  0.810607  1.439424 -0.377405
B  0.472935  1.174839  1.339455
C -0.379267  1.143235  0.649544

In [32]:
df.loc[["C", "B"], ["W"]]

          W
C -0.379267
B  0.472935

In [36]:
df.iloc[1:, 1:]

          Y         X
B  1.174839  1.339455
C  1.143235  0.649544

In [41]:
df[df["W"]>0]["X"]["A"]

-0.3774047052630291

In [51]:
df[(df["W"]>0) & (df["X"]<0)]

          W         Y         X
A  0.810607  1.439424 -0.377405

In [52]:
df.reset_index()

  index         W         Y         X
0     A  0.810607  1.439424 -0.377405
1     B  0.472935  1.174839  1.339455
2     C -0.379267  1.143235  0.649544

In [53]:
df["Countries"] = "Russia,Spain,Nain".split(",")

In [54]:
df

          W         Y         X Countries
A  0.810607  1.439424 -0.377405    Russia
B  0.472935  1.174839  1.339455     Spain
C -0.379267  1.143235  0.649544      Nain

In [56]:
df.set_index("Countries")

                  W         Y         X
Countries
Russia     0.810607  1.439424 -0.377405
Spain      0.472935  1.174839  1.339455
Nain      -0.379267  1.143235  0.649544

In [57]:
outside = ["G1", "G1", "G1", "G2", "G2", "G2"]
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [58]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [59]:
dfm = pd.DataFrame(randn(6,2), hier_index, ["A", "B"])

In [60]:
dfm

             A         B
G1 1  0.595976  0.215635
   2  0.298347 -0.166722
   3 -0.253025 -0.624331
G2 1 -1.398140  0.240815
   2 -1.313066  0.627822
   3  0.400051  0.917616

In [61]:
dfm.loc["G2"].loc[2]["A"]

-1.3130657508557853

In [62]:
dfm.xs("G2")

          A         B
1 -1.398140  0.240815
2 -1.313066  0.627822
3  0.400051  0.917616

dfm.xs(2, level=1)

In [64]:
dfm.xs(2, level=1)

           A         B
G1  0.298347 -0.166722
G2 -1.313066  0.627822

In [5]:
missing_dic = {"A": [1, 2, 3], "B": [1, np.nan, 3], "C": [1, np.nan, np.nan]}
pdmissing = pd.DataFrame(missing_dic)

In [8]:
pdmissing

   A    B    C
0  1  1.0  1.0
1  2  NaN  NaN
2  3  3.0  NaN

In [9]:
pdmissing.dropna()

   A    B    C
0  1  1.0  1.0

In [10]:
pdmissing.dropna(axis=1)

   A
0  1
1  2
2  3

In [14]:
pdmissing.dropna(thresh=2, axis=1)

   A    B
0  1  1.0
1  2  NaN
2  3  3.0

In [17]:
pdmissing.fillna(value=pdmissing["A"].mean())

   A    B    C
0  1  1.0  1.0
1  2  2.0  2.0
2  3  3.0  2.0

In [19]:
my_results = {"Company": ["GOOG", "GOOG", "MSFT", "MSFT", "FB", "FB"], 
              "Person": ["San", "Charlie", "Luans", "Alejandro", "Alberto", "Juancho"],
              "Sales": [123, 432, 545, 654, 340, 230]}

In [20]:
dfs = pd.DataFrame(my_results)

In [21]:
dfs

  Company     Person  Sales
0    GOOG        San    123
1    GOOG    Charlie    432
2    MSFT      Luans    545
3    MSFT  Alejandro    654
4      FB    Alberto    340
5      FB    Juancho    230

In [23]:
dfs.groupby("Company").sum()

         Sales
Company
FB         570
GOOG       555
MSFT      1199

In [27]:
dfs.groupby("Company").std()

              Sales
Company
FB        77.781746
GOOG     218.495995
MSFT      77.074639

In [28]:
dfs.groupby("Company").describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  285.0   77.781746  230.0  257.50  285.0  312.50  340.0
GOOG      2.0  277.5  218.495995  123.0  200.25  277.5  354.75  432.0
MSFT      2.0  599.5   77.074639  545.0  572.25  599.5  626.75  654.0

In [31]:
dfs.groupby("Company").describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   285.000000  277.500000  599.500000
      std     77.781746  218.495995   77.074639
      min    230.000000  123.000000  545.000000
      25%    257.500000  200.250000  572.250000
      50%    285.000000  277.500000  599.500000
      75%    312.500000  354.750000  626.750000
      max    340.000000  432.000000  654.000000

In [32]:
dfs.groupby("Company").describe().transpose()["FB"]

Sales  count      2.000000
       mean     285.000000
       std       77.781746
       min      230.000000
       25%      257.500000
       50%      285.000000
       75%      312.500000
       max      340.000000
Name: FB, dtype: float64

In [35]:
mydf =  pd.DataFrame({"col1": [1, 2, 3, 4],"col2": [444, 637, 123, 444], "col3": ["abc", "def", "ghi", "jkl"]})

In [36]:
mydf

   col1  col2 col3
0     1   444  abc
1     2   637  def
2     3   123  ghi
3     4   444  jkl

In [38]:
mydf["col2"].unique()

array([444, 637, 123], dtype=int64)

In [39]:
mydf["col2"].nunique()

3

In [41]:
mydf["col2"].value_counts()

444    2
123    1
637    1
Name: col2, dtype: int64

In [44]:
mydf["col2"].apply(lambda x: x*2)

0     888
1    1274
2     246
3     888
Name: col2, dtype: int64

In [46]:
mydf["col3"].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [47]:
mydf.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [48]:
mydf.index

RangeIndex(start=0, stop=4, step=1)

In [49]:
mydf.sort_values("col2")

   col1  col2 col3
2     3   123  ghi
0     1   444  abc
3     4   444  jkl
1     2   637  def

In [50]:
mydf.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False